<template>
  <div class="about">
    <div class="container">
      <div class="content">
        <h3 class="is-size-3">AZMN</h3>
        <p>Танд компютер хооронд эсвэл бүр улс тив дамжин ИХ ХЭМЖЭЭТЭЙ файл илгээх шаардлагатай тулгарч байсан уу?</p>
      </div>
      <b-tabs v-model="tab" expanded>
        <b-tab-item label="Тусламж" class="content">
          <p>3хан алхам хийхэд л хангалттай!</p>
          <ol>
            <li>Төхөөрөмжүүдээ нэг сүлжээ, эсвэл WiFi-д холбох ( өөр газраас хандах бол нэг өрөө үүсгэж орцгоох)</li>
            <li>Энэ сайтыг браузер дээрээ нээх</li>
            <li>Илгээх файлуудаа сонгоод болоо !</li>
          </ol>
          <h3 class="content is-size-5">Функцууд</h3>
          <ul>
            <li>Файлуудыг дотоод сүлжээ эвсэл интернетээр дамжуулан илгээх/хүлээж авах</li>
            <li>Нэг дотоод сүлжээнд байгаа төхөөрөмжүүдийг автоматаар хайж олно.</li>
            <li>Файл дамжуулж байхад тасалдсан бол үргэлжлүүлэх боломжтой.</li>
            <li>Илгээсэн мэссежийг автоматаар копидно.</li>
          </ul>
          <p>Та <router-link to="/settings">ТОХИРГОО </router-link> хуудсаар дамжуулан өөрчлөлтүүд хийх боломжтой.</p>
          <h3 class="content is-size-4">Асуулт хариулт</h3>
          <ul>
            <li>Би заавал хүлээн авах хүнээ холбогдсоны дараа файлуудаа хуулах уу ?</li><br/>
            <p><b>Хариулт:</b>&nbsp;<b>Үгүй</b>, та файлуудаа нэмсэний дараа таны үүсгэсэн өрөөнд хүлээн авагч орж ирвэл өрөө доторх файлуудыг хүлээж авч эхэлнэ.</p>

            <li>Windows компютер дээр бусад компютерууд харагдахгүй байна.</li><br/>
            <p><b>Хариулт:</b>&nbsp;Windows Firewall заримдаа P2P (WebRTC) холболтыг блок хийдэг. Та Firewall-аа түр унтраах эсвэл WebRTC холболтыг нээж өгөх тохиргоо хийх хэрэгтэй.</p>

            <li>Их хэмжээтэй файлуудыг интернетээр илгээхээр удаан бишүү?</li><br/>
            <p><b>Хариулт:</b>&nbsp;Интернет зөвхөн төхөөрөмжүүдийг хайж олоход ашиглана. Төхөөрөмжүүд хоорондоо шууд <b>Peer To Peer</b> холбогдоно. Интернетээр дамжуулах функцыг ашиглавал харин хурд таны болон хүлээн авагчийн интернет холболтын хурдаар хязгаарлагдана</p>

            <li>Интернетээр дамжуулах функцыг яаж ашиглах вэ ?</li><br/>
            <p><span style="display: inline-block;vertical-align: top;"><b>Хариулт:</b>&nbsp;Баруун дээд буланд байгаа "бөмбөрцөг" дүрс дээр дарж </span>&nbsp;<span style="display: inline-block;vertical-align: bottom;"><earth-icon></earth-icon></span>&nbsp;<span style="vertical-align: top;"> өрөө үүсгэнэ. Үүсгэсэн өрөөний холбоосыг хүлээн авагчид өгөх юм. АНХААР : Файл дамжуулж дуустал та энэ цонхоо нээлттэй байлгахыг анхаарна уу!</span></p>

            <li>Та нар дамжуулж байгаа файлыг харах уу ?</li><br/>
            <p><b>Хариулт:</b>&nbsp;Үгүй ! Хэзээ ч үгүй ! Peer To Peer холболт нь зөвхөн холбогдсон төхөөрөмжүүд л файлыг харах боломжийг олгодог. Үүсгэсэн өрөөгөө харин өөр хүмүүс хандуулахгүй мөн дууссан бол цонхоо хаана уу.</p>

            <li>Илгээж байгаа файлууд ямар серверт хуулагддаг вэ ?</li><br/>
            <p><b>Хариулт:</b>&nbsp;Манай сайт P2P холболт үүсгэх зорилгоор паблик торрент сүлжээ ашигладаг. Холболт үүсгэснээс хойш хэрэггүй болох ба файлууд зөвхөн илгээгч болон хүлээн авагчийн браузераар дамжина.</p>

            <li>Алдаа: Холболт үүсгэж чадахгүй байна!</li><br/>
            <p><b>Хариулт:</b>&nbsp;Танай интернет үйлчилгээ үзүүлэгч (ISP) эсвэл компанийн сүлжээний түвшинд P2P холболтыг хаасан байх магадлалтай.</p>
          </ul>
        </b-tab-item>
        <b-tab-item label="Тухай">
          <center class="content">
            <p>Сайтын хостыг <a href="https://cloud.mn" target="_blank">Үндэсний клауд үйлчилгээ үзүүлэгч</a></p>
          </center>
        </b-tab-item>
      </b-tabs>
    </div>
  </div>
</template>

<script>
import EarthIcon from 'vue-material-design-icons/Earth.vue'

export default {
  name: 'About',

  components: {
    EarthIcon
  },

  data () {
    return {
      tab: ''
    }
  }
}
</script>
